Revit 2027 API
CurveElementFilter(CurveElementType) Constructor
 Constructs a new instance of a filter to match specific types of curve elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveElementFilter(
	CurveElementType curveElementType
)
Public Sub New (
	curveElementType As CurveElementType
)
public:
CurveElementFilter(
	CurveElementType curveElementType
)
new :
        curveElementType : CurveElementType -> CurveElementFilter
Parameters
curveElementType CurveElementType
 The curve element type to match.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
CurveElementFilter Class
CurveElementFilter Overload
Autodesk.Revit.DB Namespace